// T1552.001 — 掃維運腳本尋找密碼(webshell)
SecurityEvent
| where EventID == 4688
| where CommandLine has_all ("findstr", "password")
| where ParentProcessName has "cmd.exe"  // cmd.exe 是由 w3wp 啟動的
| project TimeGenerated, Computer, Account, ParentProcessName, NewProcessName, CommandLine
| sort by TimeGenerated desc